#ifndef BSD44
#include  <limits.h>
#endif
#include <sys/types.h>
#include <stdio.h>
#include <unistd.h>
#include <stropts.h>
#include <poll.h>
#include <sys/lwp.h>
#ifdef BSD44
#include <sys/synch.h>
#else
#include <synch.h>
#include <priv.h>
#include <acl.h>
#include <audit.h>
#endif
#include <sys/stat.h>
#include <sys/ustat.h>
#include <sys/param.h>
#include <sys/procset.h>
#include <sys/priocntl.h>
#include <sys/rtpriocntl.h>
#include <sys/tspriocntl.h>
#include <sys/statvfs.h>
#include <sys/dirent.h>
#include <sys/times.h>
#include <sys/time.h>
#include <sys/resource.h>
#include <sys/signal.h>
#include <sys/mman.h>
#include <sys/ipc.h>
#include <sys/sem.h>
#include <sys/msg.h>
#include <sys/mount.h>
#include <sys/processor.h>
#include <sys/procset.h>
#include <sys/uio.h>
#include <sys/swap.h>
#include <sys/fstyp.h>
#include <sys/fsid.h>
#include <sys/uadmin.h>
#include <sys/utsname.h>
#include <sys/wait.h>
#ifdef BSD44
#include <bsm/audit.h>
#else
#include <sys/lock.h>
#include <sys/keyctl.h>
#include <sys/secsys.h>
#endif
#include <ucontext.h>
#include <fcntl.h>
#include <utime.h>
/* #include <limits.h> */
/* #include <ulimit.h> */

#ifdef _cplusplus
extern "C" {
#endif

/*********************
* Declare system calls
*********************/

#if defined(__STDC__)
extern void _exit(int status), _lwp_exit(void), *_lwp_getprivate(void);
#ifdef BSD44
extern void vhangup(void);
#endif

extern int mygetmsg(int param1, struct strbuf *param2, struct strbuf *param3, int *param4);
extern int mygetpmsg(int param1, struct strbuf *param2, struct strbuf *param3, int *param4, int *param5);
extern int myputmsg(int param1, const struct strbuf *param2, const struct strbuf *param3, int param4);
extern int myputpmsg(int param1, struct strbuf *param2, struct strbuf *param3, int param4, int param5);
extern int mypoll(struct pollfd *param1, unsigned long param2, int param3);
extern int myftruncate(int param1, off_t param2);
extern int myrename(const char *param1, const char *param2);
extern int mychdir(const char *param1);
extern int myfchdir(int param1);
extern int mychroot(const char *param1);
extern int mystatvfs(const char *param1, struct statvfs *param2);
extern int myfstatvfs(int param1, struct statvfs *param2);
extern int myfilepriv(const char *param1, int param2, priv_t *param3, int param4);
#ifndef BSD44
extern int myprofil(unsigned short *param1, unsigned int param2, unsigned int param3, unsigned int param4);
extern int mysignal(int param1);
extern int mysigset(int param1);
#endif
#else
extern int myopen(), mywait(), mytime(), mysbrk(), mylseek(), myalarm(), mysetsid();
extern int mygetpgid(), mytimes(), mygetgid(), myshmat(), myumask(), myulimit();
extern int mypathconf(), myfpathconf(), mymmap(), mysysinfo(), mycreat(), mylink();
extern int myunlink(), mychmod(), mychown(), mystat(), myutime(), myaccess();
extern int mylchown(), mymkdir(), myrmdir(), mylstat(), mysymlink(), myreadlink();
extern int mymknod(), mymkfifo(),  mytruncate():
extern int myexecl(), myexecli(),  myexeclp(), myexecv(), myexecve(), myexecvp();
extern int mypoll(),  myputpmsg(), myputmsg(), myioctl(), mygetdents();
extern int mypread(), mypwrite(),  myfstat(), myfchown(), myfchmod();
extern int myfcntl(), mypipe(),    myread(), myreadv(), mydup(), myclose();
extern int mywrite(), mywritev(),  myftruncate(), mylseek(), mygetmsg();
extern int mygetpmsg(), myrename(), mychdir(), myfchdir(), mychroot();
extern int mystatvfs(), myfstatvfs(), myfilepriv();
#ifndef BSD44
extern int myprofil(), mysignal(), mysigset()
#endif
#endif

/*******************
* Standard Constants
*******************/
#define TRUE 1        /* Boolean Usage */
#define FALSE 0

#define YES 1         /* Valid System Call */
#define NO 0          /* Invalid System Call */

#define SUCCEED 0     /* exit() usage */
#define FAIL (-1)     /* exit() & error returns */

#define MAXSCNAME                   16 
#define MAXLONG          017777777777L
#define MAX_FILES        64
#define MAX_FILESIZE    256 
#define MAX_PATHLENGTH 1024

/*************************************
* System Call Execution Control Values
**************************************/ 
#define NONE          00
#define ROOT          01

/*****************************************************
* Define testings perspective of the system call table
*****************************************************/

struct system_calls {
/* 0 */  char     sy_name[MAXSCNAME];      /* System Call Name of 16 characters */
/* 1 */  int      sy_flags;                /* Execution Control Flags */
/* 2 */  int      sy_nargs : 16;           /* Total System Call Arguments */
         int      sy_valid : 16;           /* valid Flag (Yes | No) */
/* 3 */  int      sy_loop;                 /* loop Flag (Yes | No) */
/* 4 */  int      (*sy_call) ();           /* Systme Call Handler */
/* 5 */  int      sy_ncalls;               /* Number of Requests */
/* 6 */  int      sy_passes;               /* Number of Successful Invocations */
/* 7 */  int      sy_failures;             /* Number of Failing Invocations */
/* 8 */  int      sy_tottime;              /* Total Time For This Call */ 
/* 9 */  int      sy_maxtime;              /* Maximum Time To Complete */
/* 10 */ int      sy_mintime;              /* Minimum Time To Complete */
};

#define SYSENT(desc,flags,narg,valid,looper,func) { \
        desc,flags,narg,valid,looper,func,0,0,0,0,0,MAXLONG},


/*****************************************************
* Define testings perspective of the system call table
*****************************************************/

struct system_calls scalls[] = 
{
/*       Description   Flags      Valid       Function      */
/*       (max #16)           #args     Loop                 */
/*                                                          */
SYSENT( "illegal",     NONE,  0,  YES,   NO,  nosys)        /*  0: Indirect */
SYSENT( "_exit",       NONE,  1,  YES,   NO,  nosys)        /*  1: exit */
SYSENT( "fork",        NONE,  0,  YES,   NO,  myfork)       /*  2: fork */
SYSENT( "read",        NONE,  3,  YES,   NO,  myread)       /*  3: read */
SYSENT( "write",       NONE,  3,  YES,  YES,  mywrite)      /*  4: write */
